# Тексты сообщений. Перенесено из messages/messages.py исходного проекта.

CONGRATS = ['💪 Круто! Так держать!',
            '🔪 Дикий, дерзский, как пуля резкий!',
            '🤙 Четко!',
            '🔥 Огонь!',
            '💡 Великолепно!',
            '🥸 Ты профи!',
            '🎯 В яблочко!',
            '👍 Молодец!',
            '💰 Думаю, ты можешь просить повышение!',
            '🥇 Ты чемпион!',
            '👏 Гениально!',
            '💯 Пострясающе точный ответ!',
            '🍹 Восхитительно!',
            '👊 Топчик!',
            '💎 Бриллиантово!',
            '🍾 Ура!',
            '🚀 Просто взлетно!',
            '🌟 Звездный результат!',
            '🎉 Мастерски!',
            '🏆 Непревзойденно!',
            '🎇 Впечатляюще!',
            '🌈 Ярко и красиво!',
            '🌺 Прекрасная работа!',
            '🔝 Ты на вершине!',
            '💥 Взрыв мозга!',
            '💫 Ты звезда!',
            '🤩 Блестяще!',
            '🍀 Удача на твоей стороне!',
            '🦄 Сказочно!']

WRONG = ['В следующий раз точно получится!',
         'Эм.. ну почти...)',
         'Не унывай!',
         'Просто соберись!',
         'Может тебе стоит вернутся к вопросам послше чашечки ☕️?',
         'Эх... давай еще разик?',
         'А вот здесь ты не прав(',
         'Прям совсем близко, но не то(']

READY = ['Готов!',
         'Давай его скорее!',
         '🚀 Поехали!',
         'Жду не дождусь!',
         'Полетели!',
         'Вперед, к победе!',
         'Скорее, скорее!',
         'Справлюсь на все 💯!',
         'Давай ва-банк!',
         'Вперед, к новым свершениям!',
         'Ну что там у вас?',
         'Опять эти глупые вопросы?',
         'Давай разберемся с этим',
         'Я и сам своего рода эксперт',
         'Давай посмотрим',
         'Я заждался весь!',
         'В предвкушении!']

WELCOME_MESSAGE = (
    "Привет! ✋\n\n"
    "🤖 Proverkin рад приветствовать тебя!\n\n"
    "📌 Я создан для одной цели – задавать тебе вопросы в определенное время, "
    "чтобы ты никогда не забывал важную информацию.\n\n"
    "🎮 Работа с тестом начнется автоматически, если ты уже добавлен в квиз. "
    "Вопросы отпавляются каждый день с 10 до 11 утра\n\n\n"
    "Удачи!"
)
